#### IsValidSurfaceSubcategoryForConstruction Method

---

|  |
| --- |
| ConceptualConstructionType Class   See Also |

Indicates if this ConceptualConstructionType is appropriate for the input MassSurfaceData subcategory.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public bool IsValidSurfaceSubcategoryForConstruction( 	ElementId massSurfaceSubcategoryId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsValidSurfaceSubcategoryForConstruction ( _ 	massSurfaceSubcategoryId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsValidSurfaceSubcategoryForConstruction( 	ElementId^ massSurfaceSubcategoryId ) ``` |

#### Parameters

massSurfaceSubcategoryId
:   Type:  Autodesk.Revit.DB ElementId
     The ElementId of a Mass subcategory of a MassSurfaceData.

#### Return Value

Returns true if appropriate for the input subcategory, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The input Element massSurfaceSubcategoryId is not a valid subcategory value for MassSurfaceData. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ConceptualConstructionType Class

Autodesk.Revit.DB.Analysis Namespace